renesas/ra-fsp-examples/application_projects/r11an0481/Getting_Started_with_Low_Power_Applications_Package/RA2_Application_Projects/clock_change_and_lpm_ek_ra2l1/src/lpm_app.c
/***********************************************************************************************************************
 * File Name    : lpm_app.c
 * Description  : Contains function definition related to LPM Application, LPM SM Clock SM and its associated Action
 *              : functions.
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2019 Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
#include <lpm_app_util.h>
#include "common_utils.h"
#include "hal_data.h"
#include "bsp_pin_cfg.h"

/* Board LED  Pointer */
bsp_leds_t   *leds = &g_bsp_leds;

/* Keeps track of the internal state of Current Clock and Current LPM Mode for the FSM.
 * Default Clock State and LPM  state are set to MOSC and Normal Mode
 */
clk_state_t  clk_currentState = ST_HOCO_NORM;
lpm_state_t  lpm_current_state = ST_LPM_NORM;

/* Keep track of the currently running  State Machine. By default on Power on Reset it always enters the Clock SM*/
running_SM_t running_state_machine =  CLK_SM;

/* These are LPM Mode instances for Sleep, Software Standby, Snooze and Deep Software Standby Modes. These instances
 * are created by the FSP. We need these at the Application level to take the MCU to different LPM modes with configured
 * trigger/cancel sources
 */

#if defined (BOARD_RA2L1_EK)
    lpm_instance_ctrl_t *g_lpm_ctrl_instance_ctrls[] = {
                                                            (lpm_instance_ctrl_t *)&g_lpm_sleep_ctrl,
		                                                    (lpm_instance_ctrl_t *)&g_lpm_sw_standby_ctrl,
		                                                    (lpm_instance_ctrl_t *)&g_lpm_sw_standby_with_snooze_ctrl,
    												   };
    lpm_cfg_t			*g_lpm_ctrl_instance_cfgs[]  = {
                                                            (lpm_cfg_t *)&g_lpm_sleep_cfg,
			                                                (lpm_cfg_t *)&g_lpm_sw_standby_cfg,
			                                                (lpm_cfg_t *)&g_lpm_sw_standby_with_snooze_cfg,
                                                       };
#endif

/*
 * Clock Transition Table: Event to drive this clock Transition Table are, user Switch Button inputs. When User Presses
 * the Switch for longer duration, it is considered as "Button Press - Long". When the User Presses the Switch for shorter
 * duration it is considered as "Button Press - Short". Switch pressed and held for about 1-2 Seconds is - Short Press.
 * Switch pressed and held for about 3-6 Seconds is - Long Press.
 */
const clock_state_trans_t  clock_transition_table[4][2] =
{
/********************************************************************************************/
/*                   *   Button Press - Short      *   Button Press - Long                  */
/********************************************************************************************/
/*Present State      |   Next State   Action       |   Next State,   Action                 */
/********************************************************************************************/
/*ST_HOCO_NORM */    { { ST_HOCO_NORM,  enter_lpm_sm}, { ST_MOCO_NORM, change_system_clock} },
/*ST_MOCO_NORM */    { { ST_MOCO_NORM,  enter_lpm_sm}, { ST_LOCO_NORM, change_system_clock} },
/*ST_LOCO_NORM */    { { ST_LOCO_NORM,  enter_lpm_sm}, { ST_HOCO_NORM, change_system_clock} },
/*ST_CLK_NORM  */    { { ST_HOCO_NORM,  enter_lpm_sm}, { ST_HOCO_NORM, change_system_clock} }
};

/* LPM Transition Table: Event to drive this LPM Transition Table are, User Switch Button inputs and System Generated events.
 * User Switch Button inputs are "Button Press - Long" and "Button Press - Short". System Events are Timer Events (AGT Periodic Timer, RTC alarm Interrupt.
 */

const lpm_state_tran_t lpm_transition_table[6][3] =
{
/*************************************************************************************************************************************************************************************************/
/*                         *          Button Press - Short                           *   Button Press - Long                                  *               Timer Event                        */
/*************************************************************************************************************************************************************************************************/
/*Present State            |   Next State              Action                        |   Next State,   Action                                 | Next State,             Action                   */
/*************************************************************************************************************************************************************************************************/
/*ST_LPM_NORM           */{ { ST_LPM_SLEEP,          lpm_norm_exit_sleep_entry     }, { ST_LPM_NORM,           exit_lpm_sm                  }, { ST_LPM_NORM,           no_action              } },
/*ST_LPM_SLEEP          */{ { ST_LPM_NORM_FRM_SLEEP, lpm_sleep_exit_norm_entry     }, { ST_LPM_NORM_FRM_SLEEP, lpm_sleep_exit_norm_entry    }, { ST_LPM_NORM_FRM_SLEEP, no_action              } },
/*ST_LPM_NORM_FRM_SLEEP */{ { ST_LPM_SSBY,           lpm_norm_exit_ssby_entry      }, { ST_LPM_NORM,           exit_lpm_sm                  }, { ST_LPM_NORM,           no_action              } },
/*ST_LPM_SSBY           */{ { ST_LPM_NORM_FRM_SSBY,  no_action                     }, { ST_LPM_NORM_FRM_SSBY,  no_action                    }, { ST_LPM_NORM_FRM_SSBY,  lpm_ssby_timer_action  } },
/*ST_LPM_NORM_FRM_SSBY  */{ { ST_LPM_SNZ,            lpm_norm_exit_snooze_entry    }, { ST_LPM_NORM,           exit_lpm_sm                  }, { ST_LPM_NORM_FRM_SSBY,  no_action              } },
/*ST_LPM_SNZ            */{ { ST_LPM_NORM,           no_action                     }, { ST_LPM_NORM,           no_action                    }, { ST_LPM_NORM,           lpm_snz_timer_action   } },
};


/*******************************************************************
 * @brief Pre-defined LPM Transition Sequence
 * There are 2 kinds of sequence, one supports RA6Mx device and the other supports other RA devices
 * *****************************************************************/

#if defined (BOARD_RA2L1_EK)
app_lpm_states_t g_lpm_transition_sequence[] =
{
    APP_LPM_SLEEP_STATE,                 ///< Sleep mode
    APP_LPM_SW_STANDBY_STATE,            ///< SW Standby mode
    APP_LPM_SW_STANDBY_SNOOZE_STATE,     ///< SW Standby mode with Snooze enabled
    APP_LPM_NORMAL_STATE                 ///< Normal mode
};
#endif


