renesas/ra-fsp-examples/application_projects/r11an0481/Getting_Started_with_Low_Power_Applications_Package/RA2_Application_Projects/clock_change_and_lpm_ek_ra2l1/src/lpm_app.c
/***********************************************************************************************************************
 * @brief       This function converts the FSM events into string for user debug and display purpose
 * @param[IN]   event
 * @retval      returns the equivalent string for the event.
 * @retval      Any Other event returns "UNKNOWN"
 **********************************************************************************************************************/
char *fsm_to_string(running_SM_t lfsm)
{
    switch(lfsm)
    {
      case CLK_SM:
          return "Clock State Machine";

      case LPM_SM:
          return "LPM State Machine";

      default:
    	  return "UNKNOWN";
  }
    return "UNKNOWN";
}


/***********************************************************************************************************************
 * @brief       This function converts the FSM events into string for user debug and display purpose
 * @param[IN]   event
 * @retval      returns the equivalent string for the event.
 * @retval      Any Other event returns "UNKNOWN"
 **********************************************************************************************************************/
char *event_to_string(u_event_t levent)
{
    switch(levent)
    {
      case EV_PB_SHORT_PR:
          return "EV_PB_SHORT_PR";

      case EV_PB_LONG_PR:
          return "EV_PB_LONG_PR";

      case EV_PERIODIC_TIMER:
          return "EV_PERIODIC_TIMER";

      case EV_RTC_ALARM:
          return "EV_RTC_ALARM";

      case EV_POWER_ON_RESET:
          return "EV_POWER_ON_RESET";

      case EV_NONE:
      default:
    	  return "UNKNOWN";

  }
    return "UNKNOWN";
}

/***********************************************************************************************************************
 * @brief       This function converts the FSM events into  understandable string for user Notification
 * @param[IN]   event
 * @retval      returns the equivalent string for the event.
 * @retval      Any Other event returns "Unknown"
 **********************************************************************************************************************/
char *event_to_user_string(u_event_t levent)
{
    switch(levent)
    {
      case EV_PB_SHORT_PR:
          return "-> User Push Button - (Short press)";

      case EV_PB_LONG_PR:
          return "-> User Push Button - (Long press)";

      case EV_PERIODIC_TIMER:
          return "-> Periodic timer";

      case EV_RTC_ALARM:
          return "-> RTC Alarm";

      case EV_POWER_ON_RESET:
          return "-> Power on RESET";

      case EV_NONE:
      default:
    	  return "-> Unknown";
  }
    return "-> Unknown";
}

/**********************************************************************************************************************
 * @brief       This function converts the FSM internal states into string format for user debug and display purpose
 * @param[IN]   state
 * @retval      returns the equivalent string for the state.
 * @retval      Any Other state returns "UNKNOWN"
 **********************************************************************************************************************/
char *lpm_state_to_string(lpm_state_t lstate)
{

	switch(lstate)
    {
      case ST_LPM_NORM:
    	  return "ST_LPM_NORM";

      case ST_LPM_SLEEP:
    	  return "ST_LPM_SLEEP";

      case ST_LPM_NORM_FRM_SLEEP:
    	  return "ST_LPM_NORM_FRM_SLEEP";

      case ST_LPM_SSBY:
    	  return "ST_LPM_SSBY";

      case ST_LPM_NORM_FRM_SSBY:
    	  return "ST_LPM_NORM_FRM_SSBY";

      case ST_LPM_SNZ:
    	  return "ST_LPM_SNZ";

      case ST_LPM_NORM_FRM_SNZ:
    	  return "ST_LPM_NORM_FRM_SNZ";

      default:
    	  return "UNKNOWN";
    }
	return "UNKNOWN";
}

/**********************************************************************************************************************
 * @brief       This function converts the FSM internal states into  understandable string for user Notification.
 * @param[IN]   state
 * @retval      returns the equivalent string for the state.
 * @retval      Any Other state returns "UNKNOWN"
 **********************************************************************************************************************/
char *lpm_state_to_user_string(lpm_state_t lstate)
{

	switch(lstate)
    {
      case ST_LPM_NORM:
    	  return "Normal";

      case ST_LPM_SLEEP:
    	  return "Sleep";

      case ST_LPM_NORM_FRM_SLEEP:
    	  return "Normal";

      case ST_LPM_SSBY:
    	  return "Software Standby";

      case ST_LPM_NORM_FRM_SSBY:
    	  return "Normal";

      case ST_LPM_SNZ:
    	  return "Snooze";

      case ST_LPM_NORM_FRM_SNZ:
    	  return "Normal";

      default:
    	  return "UNKNOWN";
    }
	return "Unknown";
}

/***********************************************************************************************************************
 * @brief       This function converts the FSM internal clock state into understandable string for user Notification.
 * @param[IN]   clock state
 * @retval      returns the equivalent string for the clock state.
 * @retval      Any Other state returns "UNKNOWN"
 **********************************************************************************************************************/
char *clk_to_string(cgc_clock_t cstate)
{
    switch(cstate)
    {
      case CGC_CLOCK_HOCO:
          return "HOCO CLOCK";

      case CGC_CLOCK_MOCO:
          return "MOCO CLOCK";

      case CGC_CLOCK_LOCO:
          return "LOCO CLOCK";

      case CGC_CLOCK_MAIN_OSC:
          return "MAIN OSC CLOCK";

      case CGC_CLOCK_SUBCLOCK:
          return "SUB OSC CLOCK";

      case CGC_CLOCK_PLL:
          return "PLL OSC CLOCK";

      default:
    	  return "UNKNOWN";
    }
    return "UNKNOWN";
}

/**********************************************************************************************************************
 * @brief       This function converts the FSM internal clock states into string format for user debug and display
 *              purpose only.
 * @param[IN]   clock state
 * @retval      returns the equivalent string for the clock state.
 * @retval      Any Other state returns "UNKNOWN"
 **********************************************************************************************************************/
char *clk_state_to_string(clk_state_t cstate)
{
	switch(cstate)
    {

      case ST_HOCO_NORM:
    	  return "ST_HOCO_NORM";

      case ST_MOCO_NORM:
    	  return "ST_MOCO_NORM";

