renesas/ra-fsp-examples/application_projects/r11an0481/Getting_Started_with_Low_Power_Applications_Package/RA2_Application_Projects/clock_change_and_lpm_ek_ra2l1/src/lpm_app.c
      case ST_LOCO_NORM:
    	  return "ST_LOCO_NORM";

      case ST_CLK_NORM:
    	  return "ST_CLK_NORM";

      default:
    	  return "UNKNOWN";
    }
	return "UNKNOWN";
}

/**********************************************************************************************************************
 * @brief       This function converts the FSM internal clock states into short string format for user display purpose.
 * @param[IN]   clock state
 * @retval      returns the equivalent string for the clock state.
 * @retval      Any Other state returns "UNKNOWN"
 **********************************************************************************************************************/
char *clk_state_to_user_string(clk_state_t cstate)
{
	switch(cstate)
    {

      case ST_HOCO_NORM:
    	  return "HOCO";

      case ST_MOCO_NORM:
    	  return "MOCO";

      case ST_LOCO_NORM:
    	  return "LOCO";

      case ST_CLK_NORM:
    	  return "MOSC";

      default:
    	  return "UNKNOWN";
    }
	return "UNKNOWN";
}

/**********************************************************************************************************************
 * @brief       This function changes the System Clock. Currently MOSC and SOSC are not connected on RA2L1 board.
 *              So these needs to be turned OFF
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void preffered_ra_clock_setting(void)
{
	fsp_err_t err = FSP_SUCCESS;
	/* Stop the Main Oscillator as it is not available on RA2L1-EK Board */
	err = R_CGC_ClockStop(&g_cgc0_ctrl, CGC_CLOCK_MAIN_OSC);
	if (FSP_SUCCESS != err)
	{
		APP_ERR_TRAP(err);
	}
	/* Stop the Sub Oscillator as it is not available on RA2L1-EK Board */
	err = R_CGC_ClockStop(&g_cgc0_ctrl, CGC_CLOCK_SUBCLOCK);
	if (FSP_SUCCESS != err)
	{
		APP_ERR_TRAP(err);
	}
}
/**********************************************************************************************************************
 * @brief       This function changes the System Clock to the desired clock from the User Input.
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void change_system_clock(void)
{
	fsp_err_t err = FSP_SUCCESS;
	cgc_divider_cfg_t sys_divider_cf = { RESET_VALUE };
	cgc_clock_t  sys_clock_source    = { RESET_VALUE };
	cgc_clocks_cfg_t sys_clk_cfg     = { RESET_VALUE };
	cgc_pll_cfg_t new_clk            = { RESET_VALUE };


#if defined (BOARD_RA2L1_EK)
	preffered_ra_clock_setting();
	sys_clk_cfg.mainosc_state = CGC_CLOCK_CHANGE_STOP;
#endif

	err = R_CGC_SystemClockGet(&g_cgc0_ctrl, &sys_clock_source, &sys_divider_cf);
	if (FSP_SUCCESS != err)
	{
		APP_ERR_TRAP(err);
	}

	APP_PRINT("\r\nMCU Running with Clock Source = %s, \t", clk_to_string(sys_clock_source));
	switch (clk_currentState)
	{
		case ST_HOCO_NORM:
		{
			sys_clock_source = CGC_CLOCK_HOCO;
			sys_clk_cfg.hoco_state = CGC_CLOCK_CHANGE_START;
			sys_clk_cfg.pll_cfg.source_clock = CGC_CLOCK_HOCO;
			sys_clk_cfg.pll_cfg.divider = CGC_PLL_DIV_1;
			sys_clk_cfg.pll_cfg.multiplier = 0;

			sys_clk_cfg.pll2_cfg.source_clock = CGC_CLOCK_HOCO;
			sys_clk_cfg.pll2_cfg.divider = CGC_PLL_DIV_1;
			sys_clk_cfg.pll2_cfg.multiplier = 0;

			sys_clk_cfg.divider_cfg.sckdivcr_b.pclka_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.sckdivcr_b.pclkb_div = CGC_SYS_CLOCK_DIV_2;
			sys_clk_cfg.divider_cfg.sckdivcr_b.pclkc_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.sckdivcr_b.pclkd_div = CGC_SYS_CLOCK_DIV_1;

			sys_clk_cfg.divider_cfg.sckdivcr_b.iclk_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.sckdivcr_b.bclk_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.sckdivcr_b.fclk_div = CGC_SYS_CLOCK_DIV_1;

			break;
		}
		case ST_MOCO_NORM:
		{
			sys_clock_source = CGC_CLOCK_MOCO;
			sys_clk_cfg.moco_state = CGC_CLOCK_CHANGE_START;

			sys_clk_cfg.pll_cfg.source_clock = CGC_CLOCK_MOCO;
			sys_clk_cfg.pll_cfg.divider = CGC_PLL_DIV_1;
			sys_clk_cfg.pll_cfg.multiplier = 0;

			sys_clk_cfg.pll2_cfg.source_clock = CGC_CLOCK_MOCO;
			sys_clk_cfg.pll2_cfg.divider = CGC_PLL_DIV_1;
			sys_clk_cfg.pll2_cfg.multiplier = 0;

			sys_clk_cfg.divider_cfg.sckdivcr_b.pclka_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.sckdivcr_b.pclkb_div = CGC_SYS_CLOCK_DIV_2;
			sys_clk_cfg.divider_cfg.sckdivcr_b.pclkc_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.sckdivcr_b.pclkd_div = CGC_SYS_CLOCK_DIV_1;

			sys_clk_cfg.divider_cfg.sckdivcr_b.iclk_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.sckdivcr_b.bclk_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.sckdivcr_b.fclk_div = CGC_SYS_CLOCK_DIV_1;
			break;
		}
	    case ST_LOCO_NORM:
	    {
			sys_clock_source = CGC_CLOCK_LOCO;
			sys_clk_cfg.loco_state = CGC_CLOCK_CHANGE_START;

			sys_clk_cfg.pll_cfg.source_clock = CGC_CLOCK_LOCO;
			sys_clk_cfg.pll_cfg.divider = CGC_PLL_DIV_1;
			sys_clk_cfg.pll_cfg.multiplier = 0;

			sys_clk_cfg.pll2_cfg.source_clock = CGC_CLOCK_LOCO;
			sys_clk_cfg.pll2_cfg.divider = CGC_PLL_DIV_1;
			sys_clk_cfg.pll2_cfg.multiplier = 0;

			sys_clk_cfg.divider_cfg.sckdivcr_b.pclka_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.sckdivcr_b.pclkb_div = CGC_SYS_CLOCK_DIV_2;
			sys_clk_cfg.divider_cfg.sckdivcr_b.pclkc_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.sckdivcr_b.pclkd_div = CGC_SYS_CLOCK_DIV_1;

			sys_clk_cfg.divider_cfg.sckdivcr_b.iclk_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.sckdivcr_b.bclk_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.sckdivcr_b.fclk_div = CGC_SYS_CLOCK_DIV_1;

			break;
	    }
		case ST_CLK_NORM:
		default:
		{
			sys_clock_source = CGC_CLOCK_PLL;
			sys_clk_cfg.pll_state = CGC_CLOCK_CHANGE_NONE;
			break;
		}
	}

	sys_clk_cfg.system_clock = sys_clock_source;

	err = R_CGC_ClocksCfg(&g_cgc0_ctrl, &sys_clk_cfg);
	if (FSP_SUCCESS != err)
	{
		APP_ERR_TRAP(err);
	}

	err = R_CGC_SystemClockSet(&g_cgc0_ctrl,sys_clock_source,&sys_clk_cfg.divider_cfg);
	if (FSP_SUCCESS != err)
	{
		APP_ERR_TRAP(err);
	}

	APP_PRINT("Requested Clock Source for MCU = %s \r\n",clk_to_string(sys_clock_source));

	if (CGC_CLOCK_LOCO == sys_clock_source)
	{
		new_clk.source_clock = CGC_CLOCK_LOCO;
		err = R_CGC_ClockStart(&g_cgc0_ctrl, CGC_CLOCK_LOCO, &new_clk);
		if (FSP_SUCCESS != err) {
			APP_ERR_TRAP(err);
		}

		err = R_CGC_ClockStop(&g_cgc0_ctrl, CGC_CLOCK_HOCO);
		if (FSP_SUCCESS != err)
		{
			APP_ERR_TRAP(err);
		}

		err = R_CGC_ClockStop(&g_cgc0_ctrl, CGC_CLOCK_MOCO);
		if (FSP_SUCCESS != err)
		{
			APP_ERR_TRAP(err);
		}
	}
	else if (CGC_CLOCK_MOCO == sys_clock_source)
	{
		new_clk.source_clock = CGC_CLOCK_MOCO;
		err = R_CGC_ClockStart(&g_cgc0_ctrl, CGC_CLOCK_MOCO, &new_clk);
		if (FSP_SUCCESS != err)
		{
			APP_ERR_TRAP(err);
		}

		err = R_CGC_ClockStop(&g_cgc0_ctrl, CGC_CLOCK_HOCO);
		if (FSP_SUCCESS != err)
		{
			APP_ERR_TRAP(err);
		}
	}
	else if (CGC_CLOCK_HOCO == sys_clock_source)
	{
		new_clk.source_clock = CGC_CLOCK_HOCO;

