renesas/ra-fsp-examples/application_projects/r11an0481/Getting_Started_with_Low_Power_Applications_Package/RA2_Application_Projects/clock_change_and_lpm_ek_ra2l1/src/lpm_app.c
        case APP_LPM_SW_STANDBY_STATE:
            /* Enter SW Standby mode */
            err = R_LPM_LowPowerModeEnter(p_current_ctrl);
            break;

        case APP_LPM_SLEEP_STATE:
            /* Enter Sleep mode */
            err = R_LPM_LowPowerModeEnter(p_current_ctrl);
            break;

        case APP_LPM_SW_STANDBY_SNOOZE_STATE:
            /* Enter SW Standby with Snooze enabled mode */
            err = R_LPM_LowPowerModeEnter(p_current_ctrl);
            break;

    	default:
    		/* return error */
    		err = FSP_ERR_INVALID_MODE;
    		break;
    }
	return err;
}

/*******************************************************************************************************************//**
 * @brief       This function is the Core of the FSM. Runs and transition the Clock and LPM State to new State.
 *              Initiates the Action required for the state change based on the event.
 * @param[IN]   event to the FSM
 * @retval      void
 **********************************************************************************************************************/

void  run_FSM(u_event_t  levent )
{
	clock_SM_t  l_clock_SM = {RESET_VALUE};
	lpm_SM_t  l_lpm_SM = {RESET_VALUE};

	event_type = EV_NONE;

	if(CLK_SM == running_state_machine)
    {
		l_clock_SM.clk_transition_SM = clock_transition_table[clk_currentState][levent];
		l_clock_SM.prv_state = clk_currentState;

        clk_currentState  = l_clock_SM.clk_transition_SM.next_state;
        (*l_clock_SM.clk_transition_SM.clk_action_to_do)();
    }
    else if (LPM_SM == running_state_machine)
    {
    	l_lpm_SM.lpm_tansition_SM = lpm_transition_table[lpm_current_state][levent];
    	l_lpm_SM.prv_state = lpm_current_state;

       	lpm_current_state = l_lpm_SM.lpm_tansition_SM.next_state;
        (*l_lpm_SM.lpm_tansition_SM.lpm_action_to_do)();
   }
}

/*******************************************************************************************************************//**
 * @} (end addtogroup lpm_app)
 **********************************************************************************************************************/
